Documents/гф_БлокировкаРазблокировкаОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_БлокировкаРазблокировкаОтгрузок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлокировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исключения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.гф_БлокировкаРазблокировкаОтгрузок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/гф_ПричиныБлокировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ПричиныБлокировок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидБлокировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыБлокировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/гф_БлокировкаРазблокировкаОтгрузок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
// #wortmann {
// Заполнение поля Ответственный по текущему пользователю 
// Заполнение документа при создании на основании
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&Вместо("ОбработкаЗаполнения")
Процедура гф_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.гф_БлокировкаРазблокировкаОтгрузок") Тогда
		ВидБлокировки = ДанныеЗаполнения.ВидБлокировки;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;  
		Если ДанныеЗаполнения.Заблокирован Тогда
			Заблокирован = Ложь;
		КонецЕсли;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный  = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры
// } #wortmann

// #wortmann {
// Формируем движения документа
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&Вместо("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, Режим)
	Если Заблокирован Тогда
		Движения.гф_ПричиныБлокировок.Записывать = Истина;
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Контрагент = Контрагент; 
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Заблокирован;
	Иначе
		Если Исключения Тогда 
		Движения.гф_ПричиныБлокировок.Записывать = Истина;
		// Разблокировка на текущую дату
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Контрагент = Контрагент;
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Заблокирован;
		// Блокировка на дату значения реквизита «действует до».
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = ДействуетДо;
		Движение.Контрагент = Контрагент;  
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Истина;
	Иначе
		
		Движения.гф_ПричиныБлокировок.Записывать = Истина;
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Контрагент = Контрагент; 
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Заблокирован;

	КонецЕсли; 
	
	КонецЕсли;

КонецПроцедуры
 // } #wortmann
 
#КонецОбласти

#КонецЕсли
